Revit 2026 API

# WireWiringType Property

---

The wiring type(arc or chamfer) for the wire.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WiringType WiringType { get; set; }
```
```vb
Public Property WiringType As WiringType
	Get
	Set
```
```cpp
public:
property WiringType WiringType {
	WiringType get ();
	void set (WiringType value);
}
```
```fsharp
member WiringType : WiringType with get, set
```

#### Property Value

WiringType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

If the WiringType is arc, the shape of the wire depends on the number of points - it may be linear, a circular arc, or a spline.

#### Reference

Wire Class

Autodesk.Revit.DB.Electrical Namespace